Autodesk.Revit.DB.Electrical.ConduitRun
This class represents a conduit run in Autodesk Revit.
Remarks:
This class is mainly for calculating length of a conduit run.
A conduit run contains connected straight conduit segments and bends between the straight segments with same type and size.